<pad>	0
<unk>	0
<num>	0
food	9481
place	7407
good	7325
great	5602
service	4723
time	4225
like	4023
one	3509
get	3409
go	3325
back	3147
restaurant	3126
really	3005
would	2889
ordered	2371
u	2325
order	2292
menu	2276
chicken	2204
best	2202
also	2201
nice	2030
got	1982
drink	1930
table	1923
well	1918
love	1915
try	1911
even	1910
delicious	1899
come	1882
price	1861
came	1828
always	1800
bar	1698
little	1694
meal	1677
pretty	1645
friendly	1585
dish	1553
staff	1548
eat	1526
make	1509
first	1495
much	1468
definitely	1467
thing	1443
never	1432
lunch	1427
fresh	1416
night	1390
sauce	1389
burger	1388
went	1351
amazing	1348
better	1347
salad	1344
wait	1342
server	1339
could	1337
dinner	1301
friend	1298
made	1291
experience	1287
people	1285
cheese	1272
know	1261
star	1224
say	1220
everything	1192
two	1158
beer	1150
think	1148
ever	1143
way	1125
side	1115
vega	1114
right	1099
fry	1094
minute	1087
want	1085
taco	1085
sushi	1074
bit	1058
taste	1056
day	1052
going	1045
special	1034
flavor	1033
excellent	1021
give	1002
lot	996
take	995
hour	994
atmosphere	993
bad	981
breakfast	981
rice	979
sure	970
favorite	945
something	942
happy	934
steak	932
still	931
around	931
though	926
small	925
tasty	923
since	908
roll	904
portion	904
tried	895
new	893
hot	892
sandwich	892
recommend	890
worth	886
every	884
location	884
soup	878
egg	869
said	861
next	860
awesome	850
took	848
review	830
area	824
waitress	807
many	800
meat	794
dessert	792
fried	784
wine	783
ok	778
beef	778
plate	773
big	772
last	759
asked	757
quality	751
spicy	750
another	749
long	745
visit	742
nothing	736
shrimp	726
see	724
feel	722
fish	716
waiter	709
enough	708
year	704
perfect	693
spot	689
selection	688
different	685
cooked	684
top	679
large	668
sweet	668
thai	666
find	658
full	657
looking	652
served	652
bread	650
potato	647
look	645
appetizer	643
overall	642
super	642
pork	638
quite	634
customer	634
mexican	631
home	628
huge	628
probably	628
chip	619
away	618
pizza	616
wanted	607
check	606
busy	602
however	595
la	594
thought	592
option	590
item	589
dining	586
fast	581
husband	581
tasted	576
le	576
need	573
everyone	570
told	569
enjoyed	565
ask	559
eating	553
kind	552
family	549
actually	547
maybe	540
decent	539
town	538
let	538
must	531
work	528
half	527
inside	527
usually	527
loved	526
anything	525
else	522
coming	521
choice	519
disappointed	518
salsa	515
decided	515
open	513
buffet	511
house	510
left	509
enjoy	508
outside	507
coffee	504
found	503
bean	501
seated	501
attentive	500
far	500
cream	499
fun	496
owner	496
water	488
chinese	484
noodle	482
manager	480
wife	477
old	476
least	470
fantastic	470
group	468
green	468
wonderful	467
burrito	465
looked	464
decor	463
three	460
clean	459
couple	458
especially	452
cold	452
week	452
without	451
course	448
put	448
seemed	447
party	446
bacon	439
strip	439
cool	438
free	437
ate	437
guy	434
almost	431
quick	428
high	427
french	423
entree	420
bartender	420
hard	418
used	416
red	412
onion	411
music	406
getting	402
oh	402
part	402
highly	401
bring	401
end	401
crab	398
chef	396
sat	395
size	393
room	391
finally	391
brought	389
fan	388
line	386
extra	386
point	386
although	384
style	384
tell	382
reason	382
gave	379
sit	379
stop	378
yummy	376
wrong	376
brunch	375
bite	374
wing	373
curry	373
name	371
patio	371
glass	369
chocolate	367
authentic	367
absolutely	366
whole	365
real	365
keep	365
waiting	364
cheap	363
piece	362
done	360
trying	359
wish	358
lobster	358
okay	358
late	358
several	358
either	356
may	355
start	355
seafood	355
instead	354
tea	354
slow	353
return	353
second	353
offer	351
liked	350
yes	350
ice	350
list	349
regular	347
yelp	346
hand	345
close	344
plus	341
local	341
expect	338
pancake	338
perfectly	338
average	338
started	336
warm	336
grilled	335
arrived	333
yet	332
seating	332
money	331
reservation	329
de	329
ambiance	328
kid	328
felt	328
cake	327
game	324
fine	324
care	324
reasonable	323
amount	321
weekend	320
mean	319
waited	319
live	316
deal	315
veggie	315
sunday	314
crispy	312
rib	312
salmon	311
walked	309
might	308
bowl	307
pay	307
extremely	306
impressed	306
person	304
bill	303
priced	303
business	302
trip	299
someone	299
indian	299
light	297
bland	297
dry	296
fact	296
white	294
front	294
tomato	294
type	294
serve	288
drive	288
street	288
ordering	287
later	286
saturday	286
cocktail	285
door	284
seems	284
guess	283
eaten	280
soon	279
tuna	279
called	278
today	278
variety	278
kitchen	276
flavorful	276
walk	275
saw	275
toast	274
rather	274
short	274
expensive	273
hit	272
chili	271
leave	271
making	270
use	270
bbq	270
main	270
quickly	269
tender	269
add	268
phoenix	268
mushroom	267
spice	267
show	264
hungry	262
yum	262
boyfriend	262
four	262
able	261
ingredient	261
prepared	261
tip	260
date	260
worst	260
dog	259
garlic	257
stopped	256
often	256
believe	256
girl	254
sitting	254
horrible	254
twice	254
pepper	253
cafe	252
remember	250
packed	249
terrible	248
vegetable	247
waffle	246
problem	245
cut	244
unique	244
seat	243
birthday	242
stuff	242
butter	242
mind	241
parking	241
crowd	240
margarita	239
wall	237
view	235
evening	235
mouth	234
ended	233
glad	232
pick	231
helpful	230
surprised	230
anyone	230
month	229
simple	228
pasta	228
call	228
seem	228
lady	227
already	227
joint	227
beautiful	226
pricey	224
corn	224
tortilla	223
ago	222
rude	222
city	221
past	221
given	220
morning	220
bottle	219
plenty	219
change	219
ramen	219
wow	218
along	217
heard	217
vegetarian	217
loud	217
complaint	216
overpriced	214
totally	214
cup	212
medium	212
friday	211
diner	211
cook	211
asian	211
lamb	211
seriously	210
man	210
black	209
early	209
entire	208
empty	208
completely	207
japanese	207
run	207
life	206
hope	206
sausage	205
serving	205
outstanding	205
recommended	205
opened	204
korean	203
mac	203
etc	203
expected	202
sometimes	201
dip	201
interesting	200
pleasant	200
unfortunately	199
tasting	199
seen	198
needed	198
typical	198
world	198
five	197
hostess	196
kept	196
job	196
counter	195
ready	194
share	194
watch	193
rest	193
pad	193
choose	192
value	192
set	192
die	191
help	190
taking	190
others	190
lettuce	189
thank	189
gone	189
oyster	189
employee	189
across	189
crowded	188
offered	188
soft	188
split	187
hotel	187
sour	186
near	186
feeling	186
together	185
combo	185
stay	184
grill	183
please	183
received	182
casual	182
neighborhood	182
cost	181
excited	181
easy	180
salty	180
word	180
establishment	180
sort	180
card	180
miss	179
standard	179
level	178
head	178
stick	178
filling	177
traditional	177
available	176
craving	176
solid	176
knew	175
space	175
understand	175
filled	174
located	174
bun	173
scottsdale	173
tiny	173
bagel	173
literally	172
wrap	172
mix	171
sign	170
lemon	170
finished	169
vibe	169
cute	169
middle	169
greasy	168
mediocre	168
nacho	167
healthy	166
paid	166
including	166
read	165
club	165
tv	165
incredible	165
enchilada	163
chance	163
filet	163
brown	163
blue	163
based	163
italian	163
simply	163
pie	162
taken	162
added	162
mixed	161
duck	161
scallop	161
charge	160
shop	160
finish	159
salt	159
downtown	159
sorry	159
carne	158
immediately	158
homemade	158
ton	158
orange	158
giving	157
poor	157
except	157
mine	157
guacamole	157
slice	157
asada	156
eye	156
shared	156
juicy	156
refill	156
rock	156
rare	155
forward	155
frozen	154
cuisine	154
treat	153
issue	153
smile	153
min	152
thanks	152
working	152
rating	152
generous	151
recently	151
grab	150
dollar	150
surprise	150
tofu	150
behind	149
low	149
outdoor	149
per	149
mom	149
presentation	148
hash	148
delivery	148
mention	148
banana	148
seasoned	148
stuffed	148
sport	148
expecting	147
floor	147
ambience	147
fancy	147
slightly	146
spinach	146
walking	145
anyway	145
dressing	145
included	145
visiting	145
guest	145
creamy	145
fruit	144
pita	144
store	144
write	144
greeted	144
shot	144
buck	144
turkey	144
american	143
gem	143
baked	143
anywhere	143
juice	143
belly	143
fabulous	142
upon	142
omelet	141
benedict	141
management	141
hummus	140
due	140
chipotle	140
avocado	140
truly	139
visited	138
alone	138
thick	138
boy	138
certainly	138
shake	138
unless	137
broth	137
within	136
honestly	136
pot	136
dumpling	136
noticed	136
dark	135
exactly	135
kinda	135
note	134
idea	134
total	134
bathroom	134
talking	134
roasted	134
cozy	134
oil	133
chose	133
matter	133
tap	133
opinion	133
window	133
saying	133
valley	132
desert	132
perhaps	132
dim	132
sum	132
chain	132
disappointing	131
vegan	131
crazy	131
topping	131
usual	131
non	131
lovely	131
forgot	130
weird	130
heat	130
fairly	130
ca	130
afternoon	129
limited	129
stand	128
talk	128
spring	128
perfection	128
considering	127
basically	127
dirty	127
hate	126
fair	126
prefer	126
york	126
texture	126
recommendation	126
expectation	126
young	124
dine	124
modern	124
combination	124
forever	124
paying	124
reasonably	124
touch	123
longer	123
thin	123
romantic	123
mashed	123
barely	123
mall	122
california	122
greek	122
gotten	122
whatever	122
sea	122
cannot	121
beat	121
casino	121
number	121
lol	121
box	120
pub	120
corner	120
attention	120
lack	119
environment	119
somewhere	119
et	119
hear	119
moved	118
fat	118
mostly	118
calamari	118
son	118
face	118
turn	117
thinking	117
patron	117
case	117
checked	117
comfortable	117
booth	117
gyro	116
conversation	116
topped	116
easily	116
turned	116
tonight	116
awful	116
strawberry	115
forget	115
sashimi	115
crisp	115
lived	115
country	115
pittsburgh	114
biscuit	114
request	113
summer	113
plain	113
single	113
notch	113
un	113
girlfriend	113
attitude	113
prime	113
daughter	112
gravy	112
satisfied	112
bag	112
normally	112
picture	111
cooking	111
interior	111
hang	111
raw	111
event	111
soggy	110
occasion	110
normal	110
platter	110
watching	110
martini	110
clam	110
stomach	109
happened	109
mentioned	109
incredibly	109
seasoning	109
par	109
hidden	109
worker	109
beyond	109
sound	109
charlotte	109
save	109
asking	108
thru	108
crepe	108
peanut	107
spend	107
refreshing	107
similar	107
bomb	107
ring	107
bone	107
general	107
rich	107
suggest	107
prompt	107
original	107
missing	106
sake	106
yeah	106
nicely	106
soda	105
plan	105
quiet	105
tempura	105
honey	105
olive	104
heavy	104
setting	104
clearly	104
question	104
delish	104
compared	104
avoid	104
cash	104
fill	103
sad	103
meet	103
chop	103
phone	103
imagine	103
changed	102
somewhat	102
addition	102
waste	102
classic	102
otherwise	102
iced	102
kick	101
mango	101
known	101
professional	101
arizona	101
playing	100
deep	100
pulled	100
moist	100
none	100
est	100
goat	100
affordable	99
round	99
returning	99
pas	99
quesadilla	99
polite	99
covered	99
negative	99
play	99
mood	98
disappoint	98
true	98
slider	98
coupon	98
station	98
tuesday	98
bunch	98
truffle	98
wanting	98
nearly	98
buy	98
closed	98
car	97
spectacular	97
overly	97
leaving	97
despite	97
fare	96
offering	96
monday	96
folk	96
impressive	96
rush	96
buffalo	96
shell	96
consistently	96
strong	95
crust	95
supposed	95
sized	95
chewy	95
hubby	95
pretzel	94
odd	94
apparently	94
patty	94
drinking	93
groupon	93
surprisingly	93
chile	93
personal	93
suggestion	93
cucumber	93
coconut	93
speak	92
disappointment	92
ball	92
upscale	92
meh	92
east	92
complimentary	91
basic	91
san	91
fix	91
carrot	91
exceptional	91
pleased	91
popular	90
concept	90
lacking	90
future	90
mistake	90
alright	90
worse	90
center	90
phenomenal	90
mussel	90
hole	90
worked	89
apple	89
pleasantly	89
move	89
book	89
efficient	89
bottom	89
naan	89
promptly	89
grand	88
comment	88
smell	88
madison	88
double	88
staying	88
delivered	87
mayo	87
basil	87
omelette	87
elsewhere	87
ayce	87
chorizo	87
welcome	86
met	86
doubt	86
woman	86
leg	86
rate	86
melted	86
spent	86
building	86
company	86
moment	86
pour	86
gluten	86
damn	85
pho	85
helped	85
goodness	85
broccoli	85
ground	85
overcooked	85
bf	85
caesar	85
sent	85
miso	85
bloody	85
crunchy	85
soy	85
lemonade	85
charged	85
gross	84
tough	84
ny	84
pastry	84
im	84
checking	84
superb	84
mess	84
lounge	84
park	84
obviously	83
school	83
higher	83
english	83
roast	83
heaven	83
cause	83
teriyaki	83
mother	83
beverage	83
host	83
placed	83
baby	83
omg	82
sample	82
wrapped	82
smoked	82
pre	82
nyc	82
complain	81
garden	81
break	81
appreciate	81
melt	81
pool	81
alcohol	80
kobe	80
hell	80
recent	80
flat	80
consistent	80
reading	80
mini	80
mary	80
dont	80
shopping	80
bass	80
leaf	80
nearby	79
straight	79
opted	79
specialty	79
ahead	79
market	79
lost	79
ham	78
daily	78
difficult	78
funny	78
sister	78
gras	78
positive	78
cheesecake	77
running	77
clear	77
terrific	77
vanilla	77
steamed	77
pop	77
intimate	77
pm	76
steakhouse	76
college	76
sense	76
extensive	76
eggplant	76
jalapeno	76
starter	76
board	76
ginger	76
enjoyable	76
child	76
guac	75
pickle	75
actual	75
section	75
version	75
lime	75
dozen	75
syrup	75
hoping	75
sugar	75
skip	75
sticky	74
az	74
everywhere	74
picked	74
band	74
foie	74
pudding	74
range	74
serf	74
possible	73
leftover	73
showed	73
certain	73
bother	73
memorable	73
creative	73
drop	72
till	72
chair	72
foot	72
paper	72
six	72
opening	72
larger	72
throughout	72
presented	72
update	72
sub	72
become	72
requested	71
earlier	71
south	71
lover	71
annoying	71
owned	71
sick	71
previous	71
heart	71
sliced	71
seeing	71
west	71
hold	70
unlike	70
multiple	70
cover	70
suck	70
include	70
app	70
trendy	70
notice	70
experienced	70
convenient	70
asparagus	70
donut	70
dj	69
standing	69
pa	69
ravioli	69
state	69
chunk	69
loaded	69
particularly	69
smaller	69
treated	69
eater	69
complete	69
waitstaff	68
bigger	68
fire	68
cheeseburger	68
thursday	68
wonton	68
com	68
seared	68
wonder	68
detail	68
likely	68
mr	68
suggested	68
highlight	68
consider	68
honest	67
bought	67
besides	67
montreal	67
accommodating	67
wide	67
muffin	67
airport	67
hype	67
enjoying	67
lucky	67
brother	67
credit	67
knowledgeable	67
sun	67
fluffy	66
stuck	66
king	66
happen	66
meeting	66
sadly	66
absolute	66
scene	66
joke	66
chill	66
step	66
missed	66
brisket	66
flavored	66
reviewer	66
inexpensive	66
skin	66
fajitas	66
pan	66
reminded	66
north	65
milk	65
putting	65
returned	65
mignon	65
sesame	65
machine	65
square	65
joe	65
figured	65
disgusting	65
generally	65
laid	65
apps	65
picky	65
tasteless	65
hip	65
admit	64
drunk	64
fountain	64
weather	64
dipping	64
bud	64
freshly	64
au	64
frequent	64
famous	64
personally	64
send	64
beet	64
bellagio	64
fit	63
ranch	63
falafel	63
strange	63
snack	63
mile	63
ridiculous	63
mild	63
delightful	63
closer	63
welcoming	63
vodka	63
crap	63
napkin	63
eats	63
bistro	63
relaxing	63
upset	63
ribeye	62
comfort	62
oz	62
savory	62
queso	62
catch	62
giant	62
using	62
meatball	62
finger	62
various	62
separate	62
courteous	62
stayed	61
describe	61
decide	61
student	61
risotto	61
cod	61
provided	61
self	61
team	61
da	61
awhile	61
begin	61
wood	61
basket	61
nut	60
whether	60
beginning	60
road	60
dance	60
tempe	60
hey	60
hopefully	60
plentiful	60
wild	60
realize	60
breast	60
shredded	59
luckily	59
jam	59
older	59
draft	59
story	59
creme	59
aside	59
pricing	59
gonna	59
discount	59
whenever	59
craft	59
rushed	59
hair	59
cheaper	59
ran	58
cashier	58
burnt	58
fall	58
didnt	58
class	58
major	58
tourist	58
anyways	58
willing	58
agree	58
oily	58
ahi	58
pineapple	58
chopped	58
stood	58
shame	58
continue	58
gourmet	57
particular	57
mint	57
cilantro	57
arrive	57
herb	57
term	57
register	57
delight	57
air	57
telling	57
secret	57
wise	57
inviting	57
cheddar	56
neither	56
ten	56
biggest	56
gift	56
blueberry	56
sell	56
chowder	56
en	56
fell	56
anniversary	56
al	56
hint	56
typically	56
dined	56
throw	56
correct	56
classy	56
yelpers	55
starving	55
chow	55
random	55
sampler	55
yellow	55
texas	55
brew	55
important	55
decorated	55
pink	55
co	55
member	55
thats	55
possibly	55
yesterday	55
lighting	55
passed	55
impression	55
stale	55
caramel	54
anymore	54
ale	54
bay	54
corned	54
gotta	54
handle	54
tom	54
dive	54
third	54
as	54
relatively	54
mozzarella	54
god	54
ridiculously	54
includes	54
sucked	54
vinegar	54
hamburger	54
mimosa	54
venue	54
tot	54
art	54
tequila	54
island	54
ketchup	53
football	53
southern	53
website	53
cinnamon	53
figure	53
que	53
ai	53
dad	53
con	53
properly	53
flight	53
compliment	53
cheesy	53
toasted	53
champagne	53
apologized	53
fault	53
eastern	53
dressed	53
restroom	53
chinatown	53
wednesday	52
sprout	52
anytime	52
fusion	52
hanging	52
additional	52
buttery	52
edamame	52
managed	52
excuse	52
depending	52
plastic	52
je	52
nasty	52
needle	52
raspberry	52
tired	52
writing	52
carnitas	52
mustard	52
online	52
mein	51
complained	51
ceviche	51
block	51
hipster	51
movie	51
listed	51
und	51
peak	51
explain	51
ceiling	51
bright	51
grit	51
batter	50
among	50
compare	50
signature	50
quantity	50
spaghetti	50
massive	50
rarely	50
mahi	50
tend	50
lacked	50
parmesan	50
mid	50
carte	50
takeout	50
edible	50
bell	50
el	50
hardly	50
potential	50
agreed	50
carry	50
spoke	49
sharing	49
thoroughly	49
provide	49
situation	49
repeat	49
wedding	49
pro	49
bringing	49
protein	49
explained	49
du	49
chicago	49
brings	49
relaxed	49
tab	49
followed	49
beautifully	49
oven	49
mcdonald	49
frequently	49
somehow	49
regret	49
weekday	49
berry	48
express	48
sangria	48
gorgeous	48
http	48
tail	48
gnocchi	48
tax	48
photo	48
everytime	48
happens	48
downside	48
dropped	48
spread	48
office	48
refilled	48
noisy	48
liking	48
wasabi	48
haha	48
pasty	48
tart	48
cooky	47
impeccable	47
difference	47
wearing	47
deliver	47
towards	47
dancing	47
threw	47
cent	47
parent	47
twist	47
cherry	47
onto	47
mon	47
coke	47
rave	47
masala	47
informed	47
quaint	47
stellar	47
mediterranean	47
patient	47
noise	47
pack	47
coleslaw	47
became	47
trust	47
cookie	47
fellow	46
salted	46
china	46
spending	46
key	46
st	46
drove	46
skewer	46
sold	46
slaw	46
prawn	46
age	46
luck	46
suppose	46
product	46
undercooked	46
allowed	46
container	46
season	46
annoyed	46
almond	46
tamale	46
smoke	46
shocked	46
manhattan	46
soooo	46
jack	45
dead	45
lo	45
post	45
ish	45
mill	45
satisfying	45
act	45
select	45
sooo	45
fatty	45
diet	45
grabbed	45
pastrami	45
bakery	45
fav	45
accompanied	45
planning	45
color	45
prior	45
pea	45
artichoke	45
favor	45
curd	45
kabob	45
bonus	45
sounded	45
bisque	45
spoon	45
receive	45
pound	45
distance	44
partner	44
dried	44
shit	44
jalapeño	44
moving	44
def	44
appreciated	44
decision	44
screen	44
private	44
realized	44
hill	44
watery	44
fork	44
health	44
latte	44
bruschetta	44
following	44
exception	44
minus	44
answer	44
edge	44
ignored	44
irish	44
celebrate	44
prix	44
buddy	44
frites	44
reminds	44
scrambled	44
pint	44
blown	44
cart	44
finding	44
lower	43
charming	43
balance	43
driving	43
effort	43
der	43
factor	43
appetite	43
flavorless	43
mark	43
song	43
pumpkin	43
condiment	43
watched	43
design	43
blah	43
velvet	43
seasonal	43
crunch	43
entrance	43
tapa	43
holiday	43
organic	43
farm	43
shabu	43
smelled	42
truck	42
diego	42
build	42
spacious	42
cant	42
whipped	42
grocery	42
german	42
foodie	42
lv	42
flag	42
1st	42
calling	42
thumb	42
peach	42
appeared	42
written	42
ya	42
relax	42
christmas	42
yogurt	42
uni	42
uncomfortable	42
tad	42
panini	42
kale	42
handed	41
allow	41
apology	41
headed	41
bon	41
cajun	41
www	41
poutine	41
denny	41
response	41
stone	41
nous	41
scoop	41
hurry	41
apart	41
system	41
adult	41
example	41
personable	41
pig	41
starting	41
philly	41
golden	41
rolled	41
chandler	41
jazz	41
hearing	41
rose	41
tray	41
entertainment	40
brewery	40
vacation	40
mandalay	40
memory	40
amazingly	40
travel	40
panang	40
claim	40
mexico	40
mash	40
consistency	40
btw	40
dough	40
zero	40
confused	40
meant	40
holy	40
upstairs	40
une	40
desired	40
deserves	40
pecan	40
marinated	40
mesa	40
fiance	40
valet	40
count	40
smooth	40
nt	40
breaded	39
wheat	39
pesto	39
ihop	39
divine	39
smoking	39
skillet	39
mais	39
si	39
adding	39
samosa	39
balsamic	39
palate	39
men	39
discovered	39
opportunity	39
30pm	39
2nd	39
cabbage	39
qui	39
stated	39
blow	39
drunken	39
crappy	39
village	39
ride	38
exact	38
weak	38
theme	38
boring	38
hawaiian	38
talked	38
afterwards	38
description	38
pickled	38
kimchi	38
pitcher	38
freshness	38
match	38
temperature	38
puff	38
america	38
heading	38
braised	38
nicer	38
crave	38
recipe	38
serious	38
funky	38
grease	38
bummer	38
inedible	38
obvious	38
confusing	37
calorie	37
knowing	37
venture	37
japan	37
lit	37
complaining	37
process	37
ist	37
hat	37
regardless	37
liquor	37
snow	37
comfy	37
began	37
poured	37
squash	37
trio	37
bet	37
dress	37
ordinary	37
paired	37
messy	37
smoothie	37
espresso	37
receipt	37
très	37
alternative	37
halibut	37
blt	37
nigiri	37
hearty	37
closing	37
speaking	37
diverse	37
gentleman	37
zucchini	36
prepare	36
closest	36
beware	36
poached	36
subway	36
v	36
staple	36
watermelon	36
result	36
heck	36
aware	36
law	36
triple	36
milkshake	36
custard	36
gf	36
deli	36
dream	36
croissant	36
panda	36
fake	36
palace	36
lightly	36
training	36
saving	36
fight	36
gallo	36
yellowtail	36
catfish	36
crawfish	35
boba	35
worry	35
stew	35
6pm	35
described	35
interested	35
meatloaf	35
était	35
hello	35
timely	35
bargain	35
helping	35
shoulder	35
definately	35
rated	35
crew	35
feed	35
squid	35
fully	35
named	35
awkward	35
flatbread	35
venetian	35
mountain	35
greatest	35
trouble	35
ive	35
bus	35
stumbled	35
concern	35
octopus	35
numerous	35
paris	35
everyday	35
dragon	35
los	34
kidding	34
saved	34
budget	34
coast	34
advice	34
americanized	34
learn	34
feature	34
dude	34
caught	34
nobody	34
darn	34
recall	34
flour	34
maple	34
winner	34
pairing	34
pico	34
answered	34
continued	34
pile	33
raving	33
eventually	33
companion	33
client	33
skinny	33
cauliflower	33
sage	33
hollandaise	33
traffic	33
il	33
ignore	33
bitter	33
bed	33
tikka	33
culinary	33
pastor	33
welcomed	33
wedge	33
coworkers	33
elegant	33
vietnamese	33
eatery	33
wynn	33
boiled	33
aioli	33
central	33
deserve	33
avenue	33
lie	33
avec	33
win	33
comparison	33
final	33
tenderloin	33
veg	33
refried	33
cuz	33
cramped	33
shirt	33
watering	33
equally	32
letting	32
greeting	32
mojito	32
pull	32
enormous	32
brulee	32
exterior	32
hundred	32
settled	32
yelling	32
sirloin	32
provides	32
alot	32
grub	32
consisted	32
favourite	32
spanish	32
café	32
cow	32
lukewarm	32
layer	32
constantly	32
judge	32
common	32
gas	32
ave	32
eclectic	32
indeed	32
poorly	32
hooter	32
chang	32
decoration	31
remembered	31
bulgogi	31
candle	31
um	31
varied	31
happily	31
growing	31
hibachi	31
grape	31
dans	31
fixed	31
amazed	31
manner	31
horchata	31
popcorn	31
staffed	31
support	31
appropriate	31
sampled	31
stack	31
control	31
mushy	31
raved	31
walnut	31
pomegranate	31
contact	31
udon	31
clientele	31
nom	31
jar	31
edinburgh	31
apologetic	31
wisconsin	31
ew	31
create	31
downstairs	31
generic	31
assortment	31
hop	31
stopping	31
living	31
veal	31
row	30
entertaining	30
female	30
cracker	30
wont	30
killer	30
planet	30
worthy	30
ich	30
cleaned	30
removed	30
individual	30
bien	30
allergy	30
spiced	30
concerned	30
originally	30
impossible	30
skill	30
ample	30
knife	30
fly	30
delicate	30
granted	30
shout	30
finishing	30
exciting	30
setup	30
assume	30
mainly	30
practically	30
specifically	30
del	30
whiskey	30
warning	30
ill	30
gladly	30
jerk	30
endless	30
failed	30
tartare	30
messed	30
stir	30
video	30
hamachi	30
brat	30
hookah	30
wo	30
pretentious	29
mongolian	29
wtf	29
rule	29
spoiled	29
pricy	29
church	29
considered	29
pain	29
regularly	29
fashion	29
tower	29
fave	29
ala	29
advantage	29
gold	29
exquisite	29
ticket	29
produce	29
background	29
enter	29
cousin	29
jungle	29
shack	29
squeezed	29
po	29
display	29
shortly	29
search	29
sourdough	29
brownie	29
warned	29
midnight	29
prosciutto	29
tongue	29
specific	29
tostada	29
scale	29
factory	29
period	29
wash	28
accommodate	28
feta	28
spilled	28
proceeded	28
raised	28
legit	28
palazzo	28
coworker	28
bang	28
canned	28
biz_photos	28
base	28
unbelievable	28
beach	28
ratio	28
breading	28
passing	28
handful	28
score	28
correctly	28
slight	28
appealing	28
rosemary	28
overwhelmed	28
arrival	28
posted	28
gilbert	28
worried	28
overwhelming	28
rough	28
karaoke	28
sometime	28
draw	28
paul	28
lively	28
indoor	28
mex	28
stupid	28
reliable	28
em	28
brie	28
sont	28
swear	28
freshest	28
chat	28
wished	28
smothered	28
smoothy	28
tiramisu	28
unusual	28
surprising	28
pushed	28
mgm	28
cornbread	28
bos	28
silverware	28
nicht	28
lamp	28
rainbow	28
accomodating	28
degree	27
subpar	27
kudos	27
preference	27
necessary	27
soo	27
wasnt	27
ruined	27
initially	27
gelato	27
7pm	27
destination	27
played	27
freaking	27
brand	27
ne	27
tout	27
mad	27
delectable	27
reuben	27
citrus	27
string	27
dipped	27
preparation	27
pear	27
flavour	27
piping	27
hh	27
changing	27
baguette	27
hi	27
according	27
michael	27
hung	27
verde	27
chunky	27
faster	27
forgotten	27
scrumptious	27
vinaigrette	27
overrated	27
burned	27
ce	27
acceptable	27
wei	27
cheesesteak	27
industry	27
present	27
energy	27
root	27
straw	27
thrown	27
impress	27
mole	27
fishy	27
valentine	27
sweetness	26
eh	26
baklava	26
decadent	26
inspired	26
everybody	26
scratch	26
satisfy	26
wallet	26
choosing	26
opt	26
paradise	26
sundae	26
hoped	26
tree	26
nope	26
complex	26
learned	26
selected	26
knowledgable	26
adventurous	26
charm	26
lousy	26
basis	26
father	26
tho	26
blackened	26
e	26
mixture	26
attended	26
driven	26
picking	26
weekly	26
form	26
chic	26
battered	26
history	26
tater	26
mission	26
lately	26
quarter	26
power	26
pei	26
replaced	26
screwed	26
wet	26
hence	26
gal	26
personality	26
chilled	26
minimum	26
shoe	26
cater	26
brioche	26
teppanyaki	26
twenty	26
pure	26
yay	26
improved	26
bucket	26
duty	26
earth	25
kung	25
charging	25
toilet	25
cab	25
resort	25
iron	25
keeping	25
mcdonalds	25
jersey	25
fed	25
accurate	25
balanced	25
overpowering	25
sucker	25
page	25
grew	25
assured	25
luke	25
singing	25
sticker	25
animal	25
handled	25
blend	25
bottled	25
mmm	25
celebration	25
pissed	25
swiss	25
appearance	25
refused	25
macaroon	25
currently	25
wondering	25
seaweed	25
thankfully	25
sur	25
noted	25
kill	25
fool	25
neat	25
scramble	25
india	25
directly	25
understandable	25
creamed	25
fillet	25
locally	25
broken	25
content	25
hotdog	25
remove	25
downhill	25
booked	25
angry	25
grace	25
uptown	25
war	25
id	25
nutella	25
pleasure	25
mike	25
frankly	24
thus	24
court	24
golf	24
southwest	24
caprese	24
arugula	24
skipped	24
bank	24
tomorrow	24
gut	24
language	24
pepperoni	24
category	24
tag	24
follow	24
timer	24
fondue	24
george	24
ha	24
dig	24
gyoza	24
success	24
deciding	24
adorable	24
introduced	24
diced	24
improve	24
fail	24
ocean	24
driver	24
drank	24
loaf	24
sight	24
safe	24
spicier	24
commercial	24
paneer	24
news	24
appetizing	24
mai	24
nonetheless	24
stage	24
chew	24
rack	24
body	24
flower	24
sans	24
noon	24
featured	24
creation	24
smoky	24
eel	24
kalbi	24
drawback	24
wanna	24
pride	24
infused	24
bubble	24
heavenly	24
sip	24
subtle	24
delivers	24
deliciously	24
majority	24
skirt	24
knock	24
aged	24
cross	24
combined	24
adequate	24
regarding	24
wifi	24
tucked	24
jean	24
jelly	24
array	24
fixe	24
wear	24
tso	24
unpleasant	24
trout	24
arriving	23
ipa	23
nicest	23
focus	23
candy	23
blowing	23
santa	23
auch	23
volume	23
thrilled	23
fortunately	23
healthier	23
plaza	23
oreo	23
wooden	23
se	23
3rd	23
visitor	23
snob	23
matt	23
cole	23
puree	23
push	23
instantly	23
steep	23
respect	23
social	23
occupied	23
familiar	23
cooler	23
terrace	23
punch	23
crusted	23
appears	23
wok	23
3pm	23
voice	23
unprofessional	23
asks	23
p	23
pistachio	23
minor	23
yuck	23
afraid	23
comp	23
politely	23
public	23
urban	23
package	23
flair	23
smiling	23
henderson	23
burro	23
tank	23
drinker	23
tummy	23
seven	23
poisoning	23
busier	23
cleanliness	23
brick	23
carolina	23
convenience	23
oatmeal	23
brooklyn	23
paste	22
fyi	22
winter	22
proper	22
palm	22
searching	22
unfriendly	22
satay	22
ideal	22
lame	22
spiciness	22
airy	22
concert	22
lunchtime	22
unacceptable	22
whatsoever	22
entirely	22
scallion	22
bouchon	22
conclusion	22
soaked	22
tandoori	22
hall	22
earned	22
pointed	22
entrée	22
meaty	22
cane	22
tight	22
hurt	22
conference	22
shawarma	22
john	22
mit	22
falling	22
byob	22
hangout	22
designed	22
contemporary	22
blew	22
gratuity	22
watered	22
accompanying	22
garbage	22
held	22
trash	22
knowledge	22
apologize	22
caramelized	22
10pm	22
lake	22
acted	22
hesitant	22
fashioned	22
decently	22
speed	22
comped	22
layout	22
overlooked	22
showing	22
sunny	22
9pm	22
lasagna	22
gigantic	22
tends	22
liquid	22
tokyo	22
upbeat	22
poke	22
horseradish	22
broke	22
char	22
declined	22
hooked	22
crack	21
opposite	21
seed	21
greatly	21
lentil	21
hangover	21
roberto	21
lose	21
baja	21
wasted	21
remind	21
cashew	21
mama	21
yard	21
happening	21
solely	21
deliciousness	21
hated	21
steal	21
concoction	21
sigh	21
lead	21
character	21
exceptionally	21
code	21
bench	21
thanksgiving	21
terribly	21
cobb	21
thomas	21
chai	21
occasional	21
importantly	21
cheapest	21
aka	21
rip	21
raisin	21
butt	21
smokey	21
fired	21
celebrating	21
hawaii	21
ray	21
queen	21
jump	21
seattle	21
lil	21
chick	21
drizzled	21
tempted	21
monkey	21
dick	21
mocha	21
30am	21
eve	21
entering	21
reputation	21
relleno	21
batch	21
attractive	21
involved	21
cared	21
sketchy	21
penny	21
advertised	21
university	21
switch	21
challenge	21
lazy	21
goody	21
été	21
mousse	21
scotch	21
tartar	21
rio	21
lox	21
splurge	21
microwave	21
mmmm	21
sam	21
greet	21
alfredo	21
caviar	21
msg	21
sooooo	20
runny	20
hospitality	20
account	20
essen	20
ending	20
player	20
tall	20
tao	20
temp	20
quiche	20
laugh	20
lobby	20
obnoxious	20
listen	20
ami	20
via	20
extraordinary	20
lean	20
francisco	20
newer	20
lesson	20
rangoon	20
dancer	20
magic	20
genuine	20
cranberry	20
calm	20
spit	20
lump	20
blood	20
lotus	20
nugget	20
marinara	20
amuse	20
tex	20
alley	20
strike	20
petite	20
easier	20
succulent	20
chris	20
encountered	20
approached	20
cry	20
scampi	20
couch	20
bourbon	20
raise	20
wee	20
appeal	20
fee	20
resist	20
macaroni	20
robin	20
skimp	20
cleared	20
cowboy	20
confit	20
attempt	20
purchased	20
sorbet	20
convention	20
sauteed	20
minimal	20
lackluster	20
aria	20
bear	20
wonderfully	20
screw	20
hr	20
bothered	20
track	20
grass	20
swordfish	20
congee	20
friendliest	20
grandma	20
blast	20
poker	20
comparable	19
load	19
disappoints	19
cleaning	19
wowed	19
cider	19
moon	19
pollo	19
david	19
certificate	19
trick	19
jumbo	19
executed	19
casa	19
colleague	19
bday	19
underwhelming	19
couldnt	19
ultimate	19
promised	19
hitting	19
keller	19
sommelier	19
eager	19
surrounding	19
listening	19
potstickers	19
promise	19
ah	19
email	19
feast	19
glazed	19
arm	19
clue	19
freakin	19
lux	19
hub	19
district	19
speaks	19
male	19
bowling	19
native	19
laughing	19
popped	19
pic	19
necessarily	19
fajita	19
over	19
cube	19
inch	19
semi	19
nick	19
tavern	19
caliber	19
tipped	19
hong	19
kong	19
ventured	19
entered	19
chimichanga	19
computer	19
guinness	19
bento	19
bustling	19
rye	19
tonkatsu	19
unlimited	19
forgettable	19
plat	19
latin	19
fremont	19
younger	19
hook	19
powder	19
award	19
resturant	19
reheated	19
sizzling	19
occasionally	19
preparing	19
reserved	19
warn	19
site	19
honor	19
arcadia	19
whoever	18
pao	18
sriracha	18
frill	18
pricier	18
scared	18
purpose	18
wagyu	18
booze	18
washed	18
western	18
substitute	18
test	18
papaya	18
carb	18
joy	18
parked	18
boat	18
hollywood	18
whip	18
initial	18
hilarious	18
summerlin	18
garnish	18
shut	18
exceeded	18
bleu	18
becoming	18
wendy	18
ugh	18
lastly	18
preferred	18
glaze	18
replied	18
expanded	18
chatting	18
shelf	18
manger	18
bottomless	18
bachelorette	18
generously	18
unnecessary	18
trivia	18
invited	18
11pm	18
thier	18
definite	18
regard	18
penne	18
colorful	18
stepped	18
acknowledged	18
butternut	18
stair	18
premium	18
monte	18
informative	18
ra	18
defiantly	18
bao	18
forced	18
dan	18
alcoholic	18
tossed	18
dying	18
ruin	18
foo	18
décor	18
peu	18
rim	18
warmed	18
silly	18
tasteful	18
lassi	18
overheard	18
blvd	18
advance	18
liver	18
quail	18
farmer	18
ounce	18
furniture	18
underwhelmed	18
yep	18
interest	18
maria	18
cap	18
campus	18
chilean	18
insisted	18
ryan	18
convinced	18
stocked	18
improvement	18
exotic	18
purchase	18
gracious	18
created	18
action	18
brûlée	18
unable	18
amongst	18
pf	18
bobby	18
replace	18
italy	18
unlv	18
encore	18
superior	18
passion	18
claimed	17
torta	17
cell	17
hunger	17
ultra	17
overdone	17
til	17
path	17
buying	17
munchies	17
press	17
parm	17
sale	17
bird	17
jason	17
admittedly	17
serendipity	17
fiancé	17
conveniently	17
cali	17
pinot	17
8pm	17
community	17
escargot	17
rotation	17
sprinkled	17
nervous	17
assumed	17
boot	17
standout	17
4th	17
culture	17
katsu	17
therefore	17
cheer	17
insane	17
refuse	17
planned	17
whose	17
barbacoa	17
updated	17
grade	17
buzz	17
competition	17
turning	17
shift	17
tastier	17
vous	17
authenticity	17
vraiment	17
stuffing	17
unassuming	17
blame	17
adventure	17
spirit	17
backyard	17
souffle	17
element	17
jukebox	17
careful	17
creek	17
somebody	17
tamarind	17
theater	17
sin	17
bc	17
sexy	17
separately	17
march	17
warmer	17
grown	17
eight	17
shanghai	17
fudge	17
jus	17
england	17
intense	17
tour	17
skeptical	17
river	17
rum	17
ear	17
sloppy	17
guessing	17
brussels	17
fridge	17
sautéed	17
palette	17
huevos	17
supposedly	17
yell	17
pimento	17
chosen	17
sunset	17
stout	17
manage	17
thinly	17
direction	17
edit	17
innovative	17
adobada	17
explore	17
reward	17
cupcake	17
dinning	17
roti	17
asu	16
bull	16
magnificent	16
unfortunate	16
margherita	16
chilli	16
bake	16
celery	16
zu	16
breath	16
weeknight	16
pocket	16
pair	16
utensil	16
tear	16
stare	16
overbearing	16
ppl	16
scott	16
5th	16
border	16
selling	16
phx	16
accessible	16
picnic	16
upper	16
yea	16
vast	16
splitting	16
grumpy	16
benefit	16
elevator	16
hashbrowns	16
former	16
firm	16
genuinely	16
soba	16
justify	16
substitution	16
dear	16
built	16
current	16
department	16
extreme	16
keg	16
halfway	16
ol	16
pong	16
whim	16
fifteen	16
hassle	16
speaker	16
counted	16
pace	16
trap	16
drenched	16
cantonese	16
sole	16
do	16
ultimately	16
bold	16
hide	16
kink	16
petit	16
sweat	16
stole	16
marsala	16
shoot	16
flan	16
information	16
dumped	16
gate	16
ethnic	16
fig	16
fireplace	16
peppercorn	16
piled	16
korma	16
dirt	16
natural	16
situated	16
instant	16
skimpy	16
arrogant	16
license	16
frequented	16
rabbit	16
organized	16
delay	16
advised	16
rolling	16
bliss	16
5pm	16
glance	16
pathetic	16
freezer	16
tangy	16
expert	16
hyped	16
bouche	16
towel	16
refilling	16
comforting	16
noir	16
blended	16
screaming	16
explaining	16
jose	16
meaning	16
fuss	16
rd	16
corporate	16
ripped	16
nightclub	16
tres	16
steve	16
doughy	16
jumped	16
nine	16
channel	16
slowly	16
catering	16
trained	16
cafeteria	16
led	16
cpk	16
hanger	16
shu	16
settle	16
speedy	16
blanco	16
halo	16
belgian	15
boiling	15
supermarket	15
newly	15
reviewed	15
severely	15
portobello	15
angus	15
shade	15
aber	15
acknowledge	15
royal	15
thicker	15
portioned	15
brain	15
ciabatta	15
shock	15
scone	15
toward	15
ups	15
tie	15
filipino	15
albeit	15
dislike	15
saag	15
cappuccino	15
effect	15
gabi	15
nobu	15
complimented	15
variation	15
mascarpone	15
sticking	15
kicked	15
slower	15
choy	15
becomes	15
northern	15
oxtail	15
starbucks	15
hazelnut	15
aspect	15
wrapper	15
touched	15
smart	15
desk	15
kona	15
barbecue	15
2am	15
claw	15
brazilian	15
truth	15
naturally	15
rail	15
delighted	15
anthony	15
endroit	15
questioned	15
approximately	15
sing	15
trek	15
aroma	15
taiwanese	15
addicted	15
pant	15
burn	15
monster	15
inconsistent	15
addictive	15
anybody	15
december	15
mochi	15
turf	15
brussel	15
loving	15
hesitate	15
shabby	15
escape	15
consists	15
connoisseur	15
aunt	15
continually	15
hk	15
purple	15
kindly	15
fettuccine	15
wondered	15
poblano	15
flaky	15
sampling	15
ownership	15
resident	15
rubbery	15
heated	15
shaped	15
link	15
puppy	15
slammed	15
commented	15
crudo	15
convince	15
rocked	15
machaca	15
amber	15
emeril	15
gumbo	15
habanero	15
traveling	15
overlooking	15
bonne	15
packaged	15
toro	15
horrid	15
lighter	15
kimchee	15
bibimbap	15
equal	15
schnitzel	15
insanely	15
smith	15
dairy	15
urchin	15
pinto	15
11am	15
primanti	15
guilty	15
shank	15
offended	15
outrageously	15
favs	14
remembers	14
stall	14
soap	14
killed	14
silver	14
fundido	14
tricky	14
accept	14
max	14
hockey	14
boston	14
glendale	14
adjacent	14
hmm	14
stingy	14
loin	14
qu	14
bike	14
gripe	14
soothing	14
bug	14
fooled	14
nan	14
cesar	14
soak	14
crumb	14
leek	14
carefully	14
hire	14
benny	14
kebab	14
custom	14
constant	14
acoustic	14
efficiently	14
boneless	14
responded	14
delayed	14
bok	14
beside	14
tai	14
sehr	14
dart	14
august	14
chelsea	14
miller	14
hunt	14
master	14
portuguese	14
thailand	14
avon	14
scenery	14
cure	14
fuck	14
hella	14
beaten	14
reception	14
performance	14
related	14
banquet	14
newbie	14
death	14
nowhere	14
james	14
slab	14
advise	14
accident	14
dr	14
trop	14
facility	14
rustic	14
policy	14
yr	14
reminiscent	14
approach	14
paint	14
asap	14
message	14
habit	14
huh	14
formal	14
staring	14
korea	14
soul	14
capacity	14
shape	14
stepping	14
wake	14
clothes	14
hopping	14
processed	14
thousand	14
train	14
surrounded	14
volcano	14
outrageous	14
sparkling	14
bo	14
charred	14
reach	14
dang	14
carbonara	14
force	14
survive	14
argue	14
costco	14
port	14
hut	14
inattentive	14
previously	14
loyal	14
miserable	14
kfc	14
limit	14
badly	14
alaskan	14
shitty	14
brilliant	14
flavoring	14
champaign	14
bye	14
institution	14
shady	14
postino	14
humor	14
eine	14
assuming	14
chompie	14
burning	14
ashamed	14
addicting	14
security	14
vintage	14
cutting	14
loco	14
irritated	14
rushing	14
reese	14
spam	14
provolone	14
laughed	14
intended	14
hovering	14
heater	14
european	14
adore	14
sipping	14
tan	14
couscous	14
cha	14
condescending	13
substituted	13
clubbing	13
cured	13
tooth	13
spill	13
worthwhile	13
fleming	13
opposed	13
weight	13
bj	13
disaster	13
hier	13
cracked	13
flip	13
understaffed	13
july	13
churros	13
effective	13
angeles	13
pearl	13
lb	13
ça	13
fluke	13
trade	13
strongly	13
faves	13
chi	13
reality	13
iceberg	13
mastro	13
cigar	13
seabass	13
cleaner	13
courtesy	13
crouton	13
devoured	13
dense	13
fond	13
direct	13
prep	13
wandered	13
overlook	13
diamond	13
dripping	13
unhappy	13
coat	13
harder	13
gai	13
tone	13
thoughtful	13
filthy	13
statement	13
twin	13
chilaquiles	13
fois	13
cartel	13
neck	13
epic	13
cosmo	13
supper	13
gambling	13
unbelievably	13
inconsistency	13
essentially	13
quoted	13
refund	13
busser	13
ignoring	13
vindaloo	13
clock	13
indulge	13
dietary	13
spotty	13
fear	13
breaking	13
ghetto	13
curious	13
bat	13
painting	13
apparent	13
million	13
ur	13
cosmopolitan	13
address	13
inquired	13
instance	13
understatement	13
rosa	13
gin	13
doughnut	13
1pm	13
flamingo	13
dissapointed	13
mixing	13
fails	13
attending	13
mason	13
rellenos	13
monta	13
throwing	13
tile	13
ability	13
whats	13
wir	13
marked	13
unexpected	13
mellow	13
bare	13
aussi	13
discover	13
explanation	13
knot	13
praise	13
rotating	13
yelped	13
casserole	13
macarons	13
nc	13
flying	13
rain	13
required	13
tabasco	13
kha	13
rudely	13
conscious	13
granola	13
providing	13
ed	13
sweeter	13
retro	13
sensation	13
dumb	13
colored	13
inconvenience	13
circle	13
sauerkraut	13
sooner	13
contrast	13
underneath	13
slip	13
in	13
sichuan	13
casey	13
disappeared	13
police	13
fritter	13
reflect	13
foam	13
sleek	13
concrete	13
fox	13
chez	13
afford	13
chandelier	13
citizen	13
brewed	13
warmly	13
runner	13
eggroll	13
mizu	13
suan	13
carpet	12
tacky	12
thirsty	12
human	12
unorganized	12
incident	12
wipe	12
sol	12
oddly	12
suite	12
tradition	12
jasmine	12
gobi	12
chickpea	12
grilling	12
qdoba	12
industrial	12
complementary	12
icing	12
houston	12
nose	12
teenage	12
baba	12
allergic	12
radish	12
allows	12
heirloom	12
prop	12
folded	12
2pm	12
outta	12
frank	12
definetly	12
polenta	12
fortune	12
differently	12
beignet	12
passable	12
chutney	12
festive	12
interaction	12
schedule	12
sorely	12
yo	12
dare	12
andy	12
capital	12
themed	12
izakaya	12
cheerful	12
regretted	12
steam	12
nite	12
mal	12
bored	12
caper	12
mold	12
consumed	12
restriction	12
celebrated	12
angel	12
accustomed	12
asia	12
biryani	12
grain	12
bangkok	12
satisfaction	12
guaranteed	12
greater	12
festival	12
isnt	12
fluff	12
feedback	12
imitation	12
poster	12
wherever	12
record	12
savor	12
butterfield	12
carpaccio	12
bamboo	12
lish	12
crafted	12
dump	12
cave	12
stuffy	12
elephant	12
ping	12
alive	12
chilly	12
ugly	12
jalapeños	12
downright	12
proportion	12
actor	12
risk	12
unappealing	12
struck	12
mister	12
existent	12
marinade	12
gorgonzola	12
appear	12
jewish	12
bellini	12
charcuterie	12
beverly	12
ranging	12
guard	12
michelin	12
potatoe	12
delightfully	12
moderately	12
creating	12
creativity	12
mimi	12
ichiza	12
crinkle	12
mentioning	12
blossom	12
pouring	12
accent	12
overpowered	12
hush	12
embarrassing	12
maine	12
fryer	12
metal	12
facebook	12
complement	12
recommending	12
maker	12
learning	12
newspaper	12
kosher	12
surely	12
listened	12
collection	12
kbbq	12
devil	12
homestyle	12
micro	12
hosted	12
taj	12
homey	12
simplicity	12
tripe	12
chopstick	12
uniform	12
tiger	12
tilapia	12
tony	12
clay	12
cone	12
fe	12
race	12
trend	12
wave	12
popping	12
zen	12
boo	12
caution	12
joel	12
fab	12
crossed	12
cigarette	12
coin	12
offensive	12
dug	12
holding	12
fez	12
cantina	12
frosting	12
covering	12
freezing	12
singapore	12
recognized	12
confirmed	12
report	12
distracted	12
quirky	12
jimmy	12
snapper	12
flame	12
assorted	12
stylish	12
lava	12
increase	12
noch	12
soho	12
awsome	12
bump	12
attend	12
british	12
sidewalk	12
midtown	12
supreme	11
kim	11
franchise	11
toss	11
complicated	11
carefree	11
fran	11
rank	11
memorial	11
ein	11
uw	11
continues	11
caused	11
scream	11
sink	11
inn	11
switched	11
complemented	11
resto	11
pris	11
touching	11
romaine	11
signage	11
attempted	11
raf	11
depends	11
cornish	11
sonoran	11
cutlet	11
yikes	11
arrives	11
chimi	11
thigh	11
fortunate	11
prob	11
significant	11
ac	11
cardboard	11
questionable	11
tastiest	11
bee	11
cactus	11
candied	11
wrote	11
midwest	11
kazu	11
measure	11
swimming	11
castle	11
cuban	11
toddler	11
errand	11
highest	11
sending	11
hankering	11
yolk	11
spare	11
nevertheless	11
excitement	11
thanked	11
advertise	11
indifferent	11
gooey	11
region	11
courtyard	11
altogether	11
ka	11
spite	11
busboy	11
fixture	11
mildly	11
television	11
eggrolls	11
dc	11
lychee	11
persian	11
quote	11
carlo	11
plated	11
macho	11
happier	11
stock	11
critical	11
role	11
vary	11
esp	11
pit	11
faced	11
sober	11
riesling	11
buffett	11
upside	11
sandwhich	11
linguine	11
atop	11
revisit	11
tastefully	11
facing	11
bueno	11
forgetting	11
upgrade	11
doesnt	11
stunning	11
papa	11
accompaniment	11
pozole	11
proud	11
artsy	11
extended	11
digress	11
understood	11
adovada	11
fancier	11
suit	11
surf	11
taiwan	11
repeatedly	11
encounter	11
lisa	11
meanwhile	11
proved	11
accidentally	11
savoy	11
stress	11
international	11
southwestern	11
privacy	11
whilst	11
relish	11
spotless	11
sharp	11
join	11
unremarkable	11
singer	11
neon	11
belief	11
mina	11
unusually	11
mass	11
fixing	11
banger	11
choix	11
oakland	11
gimmick	11
tortas	11
duh	11
quieter	11
apologizing	11
painted	11
requesting	11
chalkboard	11
lone	11
advertising	11
operation	11
attraction	11
comme	11
10am	11
horribly	11
mirage	11
robata	11
daniel	11
reduction	11
chimichurri	11
imo	11
pate	11
tri	11
consisting	11
nikki	11
basmati	11
sardine	11
jalepeno	11
deck	11
amanda	11
teppan	11
yelled	11
umami	11
smash	11
ease	11
mug	11
dedicated	11
gratin	11
reached	11
snobby	11
bouncer	11
ruby	11
bark	11
combine	11
celebrity	11
powdered	11
shine	11
bursting	11
puck	11
desire	11
accommodated	11
ho	11
incompetent	11
fu	11
button	11
vig	11
relative	11
thee	11
arcade	11
pale	11
heavily	11
cinco	11
turnover	11
buzzing	11
nightmare	11
rotten	11
flourless	11
confusion	11
successful	11
print	11
execution	11
canal	11
there	11
diablo	11
balcony	11
diversity	11
exit	11
wandering	11
lane	11
circus	11
sensitive	11
shaved	11
republic	11
restuarant	11
porterhouse	11
stool	11
fate	11
inventive	11
mi	11
flare	11
hyde	11
anna	11
pizzeria	11
largest	10
pet	10
slide	10
bummed	10
dimly	10
robertos	10
born	10
multi	10
zone	10
hometown	10
smashed	10
plane	10
terminal	10
reluctant	10
coma	10
sang	10
optional	10
rid	10
anyhow	10
honesty	10
promotion	10
source	10
chatted	10
latest	10
salivating	10
leather	10
dill	10
atrocious	10
bi	10
wheelchair	10
traveled	10
catered	10
plethora	10
intriguing	10
styrofoam	10
approx	10
hotter	10
proof	10
moderate	10
colorado	10
smoker	10
depth	10
pony	10
memorabilia	10
fastest	10
biggie	10
avoided	10
sorta	10
squeeze	10
mojitos	10
pass	10
labeled	10
gather	10
blond	10
recognize	10
dave	10
playoff	10
repeated	10
hungover	10
blaring	10
skate	10
sand	10
field	10
bridge	10
reverse	10
snap	10
gathering	10
heartbeat	10
ck	10
gruyere	10
plantain	10
ricotta	10
fresher	10
tonkotsu	10
szechuan	10
caters	10
status	10
backed	10
entre	10
aux	10
frequenting	10
gesture	10
idiot	10
yelper	10
swing	10
oj	10
baseball	10
fucking	10
apartment	10
label	10
substantial	10
roof	10
chase	10
executive	10
criticism	10
shocking	10
lick	10
component	10
pacific	10
siam	10
distinct	10
peking	10
sock	10
sheet	10
rowdy	10
pakistani	10
remaining	10
us	10
wilted	10
oasis	10
someplace	10
patience	10
branch	10
cloth	10
mule	10
rancheros	10
rubber	10
corkage	10
tomatillo	10
graduation	10
film	10
entrées	10
earthy	10
ranged	10
attendant	10
county	10
stamp	10
packet	10
attack	10
premise	10
entry	10
creates	10
remain	10
orleans	10
russian	10
remodeled	10
arranged	10
sophisticated	10
sp	10
strangely	10
spin	10
timing	10
sky	10
float	10
thali	10
captain	10
handmade	10
drizzle	10
fest	10
slot	10
für	10
sporting	10
embarrassed	10
operated	10
dropping	10
yakisoba	10
winning	10
tropical	10
roe	10
luxor	10
oscar	10
th	10
renovation	10
peter	10
hmmm	10
payment	10
tuck	10
pushing	10
roosevelt	10
unfamiliar	10
tar	10
cottage	10
pepsi	10
out	10
europe	10
beijing	10
incorrect	10
keith	10
daring	10
hallway	10
entertained	10
microwaved	10
snag	10
tataki	10
bitch	10
project	10
spoonful	10
outdated	10
splash	10
vent	10
neighbor	10
filler	10
curtain	10
thinner	10
cancel	10
energetic	10
throat	10
judging	10
mirror	10
decade	10
tzatziki	10
tuk	10
crime	10
basement	10
automatically	10
hilton	10
turnip	10
peace	10
yup	10
accompany	10
fait	10
croquette	10
research	10
atelier	10
anthem	10
4pm	10
takeaway	10
handling	10
hefty	10
treasure	10
moo	10
robuchon	10
balloon	10
friendliness	10
nephew	10
slimy	10
redeeming	10
gordo	10
bison	10
timo	10
divey	10
youre	10
rainy	10
jr	10
jade	10
loudly	10
presence	10
printed	10
marshmallow	10
ensure	10
garage	10
nach	10
wi	10
fi	10
bizarre	10
crabmeat	10
pulling	10
todd	10
confirm	10
partying	10
stella	10
beau	10
pleasing	10
auf	10
croque	10
insert	10
cob	10
wicked	10
jim	10
model	10
fin	10
disney	10
defense	10
délicieux	10
williamsburg	10
solo	10
friendlier	10
washington	10
elbow	10
saul	10
femme	10
bob	9
macadamia	9
lying	9
kilt	9
outing	9
prosecco	9
converted	9
reviewing	9
glorious	9
drowned	9
dissatisfied	9
mayonnaise	9
task	9
immer	9
nur	9
aloo	9
standby	9
grande	9
filiberto	9
jacket	9
hesitation	9
talkative	9
intrigued	9
eddie	9
joined	9
turkish	9
iphone	9
alors	9
buttermilk	9
moroccan	9
bow	9
delicous	9
google	9
require	9
dente	9
technique	9
tremendous	9
speechless	9
accordingly	9
applebee	9
theatre	9
proximity	9
gym	9
brian	9
primarily	9
guarantee	9
chalk	9
camelback	9
tempting	9
verdict	9
urge	9
cumin	9
serrano	9
allowing	9
staffing	9
earn	9
porter	9
november	9
union	9
exist	9
suddenly	9
horror	9
domestic	9
rachel	9
attire	9
flavourful	9
creepy	9
carbs	9
worn	9
halloween	9
sprite	9
slowest	9
rub	9
remarkable	9
loose	9
shallot	9
lee	9
salade	9
smiled	9
suffer	9
pregnant	9
utterly	9
musician	9
freak	9
plum	9
cork	9
imported	9
mouthful	9
handy	9
sweating	9
tipsy	9
understanding	9
catching	9
pretend	9
homeless	9
panko	9
historic	9
waterfall	9
hottest	9
pin	9
wound	9
eyed	9
knocked	9
crispiness	9
april	9
barrio	9
supporting	9
flank	9
humble	9
sublime	9
remotely	9
thirty	9
frog	9
spotted	9
grabbing	9
decatur	9
secondly	9
stacked	9
shellfish	9
cellar	9
sourced	9
coating	9
aesthetic	9
graciously	9
definition	9
niece	9
cereal	9
lengua	9
tommy	9
guitar	9
explains	9
dosa	9
info	9
frying	9
existed	9
sever	9
camera	9
okra	9
ad	9
sodium	9
hired	9
vip	9
grateful	9
senior	9
referring	9
chaat	9
canadian	9
lining	9
coated	9
crusty	9
cheek	9
roach	9
wth	9
benihana	9
beforehand	9
ox	9
national	9
earl	9
touristy	9
cop	9
00pm	9
core	9
louder	9
meter	9
hopped	9
finest	9
firehouse	9
routine	9
infamous	9
compote	9
wishing	9
fella	9
fourth	9
leur	9
lured	9
haunt	9
jumper	9
3am	9
disgusted	9
dal	9
saffron	9
article	9
panna	9
randy	9
genius	9
coolest	9
madness	9
snooze	9
gazpacho	9
smallest	9
dissappointed	9
wasting	9
limp	9
alike	9
nevada	9
branzino	9
steel	9
bialy	9
blonde	9
foul	9
mmmmmm	9
chart	9
garnished	9
mic	9
norm	9
taxi	9
louisiana	9
einen	9
priority	9
sa	9
outfit	9
15pm	9
grow	9
anticipated	9
owns	9
bumped	9
idk	9
kiltlifter	9
murray	9
roommate	9
ufc	9
network	9
pressed	9
updating	9
considerate	9
tablecloth	9
cabo	9
moco	9
land	9
murphy	9
lollipop	9
gristle	9
mixer	9
tgi	9
artist	9
visible	9
rehearsal	9
promo	9
seek	9
tonic	9
chive	9
receiving	9
dent	9
antipasti	9
bww	9
zum	9
visually	9
exposed	9
brasserie	9
burgh	9
torn	9
transported	9
length	9
gun	9
artwork	9
moi	9
fiancee	9
pete	9
unknown	9
mush	9
chilies	9
zesty	9
sui	9
narrow	9
swanky	9
haus	9
dt	9
madame	9
wiz	9
blanket	9
lip	9
plant	9
dem	9
jun	9
conditioning	9
rent	9
bombay	9
dimsum	9
refer	9
pureed	9
wong	9
freindly	9
bukhara	9
jekyll	9
fifth	8
stroll	8
juan	8
inform	8
smelling	8
pressure	8
rag	8
purse	8
thankful	8
bravo	8
rubbed	8
highway	8
sw	8
immediate	8
forgive	8
hispanic	8
plump	8
dime	8
unimpressive	8
viel	8
quicker	8
frat	8
contain	8
quinoa	8
radio	8
clerk	8
tidy	8
reserve	8
substandard	8
bart	8
hustle	8
duce	8
frustration	8
suggesting	8
asiago	8
pescado	8
shoestring	8
afterward	8
omakase	8
carafe	8
seeking	8
internet	8
emphasis	8
mesquite	8
agave	8
carryout	8
unlikely	8
mojo	8
aureole	8
retail	8
empanadas	8
chaotic	8
precious	8
ben	8
gordon	8
frame	8
outdoors	8
gummy	8
bingo	8
buttered	8
dealt	8
tee	8
snooty	8
unbearable	8
caring	8
biz	8
refined	8
versus	8
morsel	8
merlot	8
lite	8
fulfilling	8
gosh	8
hiccup	8
vacant	8
lulu	8
sliver	8
adam	8
maryland	8
dangerous	8
brag	8
bailey	8
uber	8
replacement	8
être	8
vibrant	8
bumping	8
payed	8
forth	8
activity	8
smoothly	8
uninspired	8
grove	8
foster	8
rotisserie	8
tube	8
pinch	8
layered	8
hotcake	8
stating	8
competent	8
drip	8
crumbled	8
grandmother	8
cast	8
bound	8
ole	8
encourage	8
deserving	8
te	8
answering	8
pt	8
uh	8
seemingly	8
purely	8
appreciative	8
marketplace	8
ginormous	8
happiness	8
sammy	8
hippy	8
dingy	8
ont	8
loss	8
bubbly	8
douche	8
bum	8
workout	8
muy	8
peep	8
debit	8
painful	8
graze	8
